test/artillery/flow.yaml
config:
  pluggins:
    metrics-by-endpoint : {}
  target: http://localhost:9000/api
  phases:
    - duration: 10
      arrivalRate: 50
scenarios:
  - name: login
    flow:
      - log: login
      - post:
          url: /sessions/login
          json:
            email: arielendrizzi78@gmail.com
            password: 1234ab
  - name: products
    flow:    
      - log: read all products
      - get:
          url: /products